Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐེག་པ་ཆེན་པོ་འདི་ལྟ་སྟེ། དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་སྟེ།
en: Chapter 9 “Moreover, Subhūti, the Great Vehicle of bodhisattva great beings also entails the four applications of mindfulness.

source: བཞི་གང་ཞེ་ན། ལུས་དྲན་པ་ཉེ་བར་གཞག་པ་དང་། ཚོར་བ་དྲན་པ་ཉེ་བར་གཞག་པ་དང་། སེམས་དྲན་པ་ཉེ་བར་གཞག་པ་དང་། ཆོས་དྲན་པ་ཉེ་བར་གཞག་པའོ།
en: If you ask what these four are, they comprise the application of mindfulness with regard to the body, the application of mindfulness with regard to feelings, the application of mindfulness with regard to the mind, and the application of mindfulness with regard to phenomena. {

source: །དེ་ལ་ལུས་དྲན་པ་ཉེ་བར་གཞག་པ་གང་ཞེ་ན།
en: Dt.204} “You may ask what is the application of mindfulness with regard to the body.

source: རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནང་གི་ལུས་ལ་དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་ལུས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་།
en: In this respect, Subhūti, bodhisattva great beings, with regard to the inner body, observe the physical body without apprehending anything.

source: བརྩོན་འགྲུས་ཅན་ཤེས་བཞིན་དང་ལྡན་པ། དྲན་པ་དང་ལྡན་པས། འཇིག་རྟེན་གྱི་ཆགས་སེམས་དང་། ཡིད་མི་བདེ་བ་རྣམ་པར་བསལ་ཅིང་རྣམ་པར་སྤྱོད་ཀྱང་། ལུས་དང་ལྡན་པའི་རྣམ་པར་རྟོག་པ་རྣམས་ལ་རྣམ་པར་མི་རྟོག་གོ །
en: As they conduct themselves, diligent, alert, and mindful, rid of the world’s attractions and dissatisfactions, they do not form conceptual thoughts associated with the body.

source: ཕྱིའི་ལུས་ལ་དེ་མི་དམིགས་པའི་ཚུལ་གྱིས། ལུས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་། བརྩོན་འགྲུས་ཅན་ཤེས་བཞིན་དང་ལྡན་པ།
en: With regard to the outer body, they observe the physical body without apprehending anything.

source: དྲན་པ་དང་ལྡན་པས། འཇིག་རྟེན་གྱི་ཆགས་སེམས་དང་། ཡིད་མི་བདེ་བ་རྣམ་པར་བསལ་ཅིང་། རྣམ་པར་སྤྱོད་ཀྱང་། ལུས་དང་ལྡན་པའི་རྣམ་པར་རྟོག་པ་རྣམས་ལ་རྣམ་པར་མི་རྟོག་གོ །
en: As they conduct themselves, diligent, alert, and mindful, rid of the world’s attractions and dissatisfactions, they do not form conceptual thoughts associated with the body.

source: ཕྱི་ནང་གི་ལུས་ལ་དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་ལུས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་།
en: With regard to the outer and inner body, they observe the physical body without apprehending anything.

source: ནང་གི་ཚོར་བ་དང་། སེམས་དང་། ཆོས་ལ་དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་ཆོས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་།
en: With regard to inner feelings, mind, and phenomena, they observe phenomena [and so forth] without apprehending anything.

source: བརྩོན་འགྲུས་ཅན་ཤེས་བཞིན་དང་ལྡན་པ། དྲན་པ་དང་ལྡན་པས། འཇིག་རྟེན་ཀྱི་ཆགས་སེམས་དང་། ཡིད་མི་བདེ་བ་རྣམ་པར་བསལ་ཅིང་རྣམ་པར་སྤྱོད་ཀྱང་། ཆོས་དང་ལྡན་པའི་རྣམ་པར་རྟོག་པ་རྣམས་ལ་རྣམ་པར་མི་རྟོག་གོ །
en: As they conduct themselves, diligent, alert, and mindful, rid of the world’s attractions and dissatisfactions, they do not form conceptual thoughts associated with phenomena [and so forth].

source: ཕྱིའི་ཚོར་བ་དང་། སེམས་དང་། ཆོས་ལ་དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་ཆོས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་།
en: With regard to outer feelings, mind, and phenomena, they observe phenomena [and so forth] without apprehending anything.

source: བརྩོན་འགྲུས་ཅན་ཤེས་བཞིན་དང་ལྡན་པ། དྲན་པ་དང་ལྡན་པས། འཇིག་རྟེན་གྱི་ཆགས་སེམས་དང་། ཡིད་མི་བདེ་བ་རྣམ་པར་བསལ་ཅིང་རྣམ་པར་སྤྱོད་ཀྱང་། ཆོས་དང་ལྡན་པའི་རྣམ་པར་རྟོག་པ་རྣམས་ལ་རྣམ་པར་མི་རྟོག་གོ །
en: As they conduct themselves, diligent, alert, and mindful, rid of the world’s attractions and dissatisfactions, they do not form conceptual thoughts associated with phenomena [and so forth].

source: ཕྱི་ནང་གི་ཚོར་བ་དང་། སེམས་དང་། ཆོས་ལ་དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་ཆོས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་།
en: With regard to outer and inner feelings, mind, and phenomena, they observe phenomena [and so forth] without apprehending anything.

source: རབ་འབྱོར་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནང་གི་ལུས་ལ་ལུས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་རྣམ་པར་སྤྱོད་པ་ཡིན་ཞེ་ན། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འགྲོ་ན་འགྲོའོ་ཞེས་བྱ་བར་རབ་ཏུ་ཤེས་སོ།
en: Subhūti, if you ask how, with regard to the inner body, bodhisattva great beings continue to observe the physical body, in this respect, Subhūti, when bodhisattva great beings are moving, they are fully aware that they are moving.

source: །འགྲེང་ན་འགྲེང་ངོ་ཞེས་བྱ་བར་རབ་ཏུ་ཤེས་སོ།
en: When they are standing upright, they are fully aware that they are standing upright.

source: །འདུག་ན་འདུག་གོ་ཞེས་བྱ་བར་རབ་ཏུ་ཤེས་སོ།
en: When they are sitting, they are fully aware that they are sitting.

source: །ཉལ་ན་ཉལ་ལོ་ཞེས་བྱ་བར་རབ་ཏུ་ཤེས་ཏེ།
en: When they are lying down, they are fully aware that they are lying down.

source: དེའི་ལུས་ཉམས་བདེ་བ་འམ། མི་བདེ་ཡང་རུང་། ལུས་ཇི་ལྟ་ཇི་ལྟར་གནས་པ། དེ་ལྟ་དེ་ལྟར་དེས་རབ་ཏུ་ཤེས་སོ།
en: When the body is comfortable or uncomfortable, and in whatever ways the body changes its posture, they are fully aware.

source: །རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནང་གི་ལུས་ལ་དེ་མི་དམིགས་པའི་ཚུལ་གྱིས། ལུས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་བརྩོན་འགྲུས་ཅན། ཤེས་བཞིན་དང་ལྡན་པ།
en: Subhūti, it is in such ways that bodhisattva great beings, with regard to the inner body, observe the physical body without apprehending anything.

source: དྲན་པ་དང་ལྡན་པས། འཇིག་རྟེན་གྱི་ཆགས་སེམས་དང་། ཡིད་མི་བདེ་བ་རྣམ་པར་བསྩལ་ཅིང་རྣམ་པར་སྤྱོད་དོ།
en: As they conduct themselves, diligent, alert, and mindful, rid of the world’s attractions and dissatisfactions. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནང་གི་ལུས་ལ་དེ་མི་དམིགས་པའི་ཚུལ་གྱིས། ལུས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་རྣམ་པར་སྤྱོད་དོ།
en: Moreover, Subhūti, with regard to the inner body, bodhisattva great beings continue to observe the physical body without apprehending anything.

source: །དེ་འགྲོ་འམ་འོང་ཡང་ཤེས་བཞིན་དུ་སྤྱོད་པ་ཡིན།
en: They maintain alertness, whether they are going out or returning home.

source: ལྟའམ། རྣམ་པར་ལྟ་ཡང་། ཤེས་བཞིན་དུ་སྤྱོད་པ་ཡིན།
en: They maintain alertness, whether they are looking [outwardly] or looking introspectively.

source: བསྐུམ་འམ། བརྐྱང་ཡང་ཤེས་བཞིན་དུ་སྤྱོད་པ་ཡིན།
en: They maintain alertness, whether they are bending or stretching their limbs.

source: སྦྱར་མ་དང་། ལྷུང་བཟེད་འཆང་ཞིང་སྤྱོད་ཀྱང་ཤེས་བཞིན་དུ་སྤྱོད་པ་ཡིན།
en: They maintain alertness, whether they are holding an outer patched robe, a waist cloth, or an alms bowl.

source: ཟོས་པ་དང་། འཆོས་པ་དང་། འཐུངས་པ་དང་། མྱངས་པ་ལ་ཡང་ཤེས་བཞིན་དུ་སྤྱོད་པ་ཡིན།
en: They maintain alertness, whether they are eating, drinking, chewing, or tasting.

source: ཉལ་བ་དང་། གཉིད་ཀྱི་མྱ་མྱོ་བསལ་བ་ཡང་ཤེས་བཞིན་དུ་སྤྱོད་པ་ཡིན། འགྲོ་བ་དང་། འོང་བ་དང་། འགྲེང་བ་དང་།
en: They maintain alertness, whether they are resting or waking up.

source: འདུག་པ་དང་། གཉིད་ཀྱིས་ལོག་པ་དང་། མ་ལོག་པ་དང་། སྨྲ་བ་དང་། མི་སྨྲ་བ་དང་།
en: They maintain alertness, whether they are coming or going, standing or sitting, reclining or not reclining, speaking or not speaking, or settled in meditation [or arising from meditation].

source: ནང་དུ་ཡང་དག་འཇོག་ལ་ཡང་ཤེས་བཞིན་དུ་སྤྱོད་པ་ཡིན་ཏེ། རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ནང་གི་ལུས་ལ་དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་ལུས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་།
en: Subhūti, it is in this way that when bodhisattva great beings practice the perfection of wisdom, with regard to the inner body, they observe the physical body without apprehending anything.

source: བརྩོན་འགྲུས་ཅན་ཤེས་བཞིན་དང་ལྡན་པ། དྲན་པ་དང་ལྡན་པས། འཇིག་རྟེན་གྱི་ཆགས་སེམས་དང་། ཡིད་མི་བདེ་བ་རྣམ་པར་བསྩལ་ཅིང་རྣམ་པར་སྤྱོད་དོ།
en: As they conduct themselves, diligent, alert, and mindful, they are rid of the world’s attractions and dissatisfactions. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། དྲན་ཞིང་དབུགས་ནང་དུ་རྒྱུ་ན་ཡང་། དྲན་ཞིང་དབུགས་ནང་དུ་རྒྱུའོ། །ཞེས་བྱ་བར་རབ་ཏུ་ཤེས་སོ།
en: Moreover, Subhūti, when bodhisattva great beings practice the perfection of wisdom, they are fully aware that when they inhale breath mindfully, they are inhaling breath mindfully.

source: །དྲན་ཞིང་དབུགས་ཕྱིར་རྒྱུ་ན་ཡང་། དྲན་ཞིང་དབུགས་ཕྱིར་རྒྱུའོ་ཞེས་བྱ་བར་རབ་ཏུ་ཤེས་སོ།
en: They are fully aware that when they exhale breath mindfully, they are exhaling breath mindfully.

source: །དབུགས་ནང་དུ་རིང་དུ་རྒྱུ་ན་ཡང་། དབུགས་ནང་དུ་རིང་དུ་རྒྱུའོ་ཞེས་བྱ་བར་རབ་ཏུ་ཤེས་སོ། །དབུགས་ཕྱིར་རིང་དུ་རྒྱུ་ན་ཡང་། དབུགས་ཕྱིར་རིང་དུ་རྒྱུའོ་ཞེས་བྱ་བར་རབ་ཏུ་ཤེས་སོ། །དབུགས་ནང་དུ་ཐུང་དུ་རྒྱུ་ན་ཡང་།
en: They are fully aware that when they inhale a long breath, they are inhaling a long breath, and that when they are exhaling a long breath, they are exhaling a long breath. {

source: དབུགས་ནང་དུ་ཐུང་དུ་རྒྱུའོ་ཞེས་བྱ་བར་རབ་ཏུ་ཤེས་སོ། །དབུགས་ཕྱིར་ཐུང་དུ་རྒྱུ་ན་ཡང་། དབུགས་ཕྱིར་ཐུང་དུ་རྒྱུའོ་ཞེས་བྱ་བར་རབ་ཏུ་ཤེས་སྟེ།
en: Dt.205} They are fully aware that when they are inhaling a short breath, they are inhaling a short breath, and that when they are exhaling a short breath, they are exhaling a short breath.

source: རབ་འབྱོར་འདི་ལྟ་སྟེ། དཔེར་ན། རྫ་མཁན་འཁོར་ལོ་བསྐོར་བ་འམ།
en: Subhūti, this resembles, as an analogy, a potter turning a wheel or a skilled apprentice of a potter turning a wheel.

source: རྫ་མཁན་འཁོར་ལོ་བསྐོར་བའི་མཆན་བུ་མཁས་པ་ནི་རིང་དུ་བསྐོར་ན་རིང་དུ་བསྐོར་རོ་ཞེས་བྱ་བར་རབ་ཏུ་ཤེས་སོ། །ཐུང་དུ་བསྐོར་ན་ཐུང་དུ་བསྐོར་རོ་ཞེས་བྱ་བར་རབ་ཏུ་ཤེས་སོ།
en: They are fully aware that when they are turning the wheel in a long whirl, they are turning the wheel in a long whirl, and they are fully aware that when they are turning the wheel in a short whirl, they are turning the wheel in a short whirl.

source: །རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། དྲན་པར་དབུགས་ནང་དུ་རྒྱུས་ན་ཡང་། དྲན་པར་དབུགས་ནང་དུ་རྒྱུས་སོ་ཞེས་བྱ་བར་རབ་ཏུ་ཤེས་སོ། །དྲན་པར་དབུགས་ཕྱིར་རྒྱུས་ན་ཡང་། དྲན་པར་དབུགས་ཕྱིར་རྒྱུས་སོ་ཞེས་བྱ་བར་རབ་ཏུ་ཤེས་སོ།
en: Likewise, Subhūti, when bodhisattva great beings practice the perfection of wisdom, they are fully aware that they are inhaling breath mindfully when they inhale breath mindfully, and they are fully aware that they are exhaling breath mindfully when they exhale breath mindfully.

source: །དབུགས་རིང་དུ་ནང་དུ་རྒྱུས་ན་ཡང་། དབུགས་རིང་དུ་ནང་དུ་རྒྱུས་སོ་ཞེས་བྱ་བར་རབ་ཏུ་ཤེས་སོ།
en: When they are inhaling a long breath, they are fully aware that they are inhaling a long breath.

source: །དབུགས་རིང་དུ་ཕྱིར་རྒྱུས་ན་ཡང་། དབུགས་རིང་དུ་ཕྱིར་རྒྱུས་སོ་ཞེས་བྱ་བར་རབ་ཏུ་ཤེས་སོ།
en: When they are exhaling a long breath, they are fully aware that they are exhaling a long breath.

source: །དབུགས་ཐུང་དུ་ནང་དུ་རྒྱུས་ན་ཡང་། དབུགས་ཐུང་དུ་ནང་དུ་རྒྱུས་སོ་ཞེས་བྱ་བར་རབ་ཏུ་ཤེས་སོ།
en: When they are inhaling a short breath, they are fully aware that they are inhaling a short breath.

source: །དབུགས་ཐུང་དུ་ཕྱིར་རྒྱུས་ན་ཡང་། དབུགས་ཐུང་དུ་ཕྱིར་རྒྱུས་སོ་ཞེས་བྱ་བར་རབ་ཏུ་ཤེས་ཏེ།
en: When they are exhaling a short breath, they are fully aware that they are exhaling a short breath.

source: །རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ནང་གི་ལུས་ལ་དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་ལུས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་།
en: Subhūti, it is in such ways that when bodhisattva great beings practice the perfection of wisdom, with regard to the inner body, they observe the physical body without apprehending anything.

source: བརྩོན་འགྲུས་ཅན་ཤེས་བཞིན་དང་ལྡན་པ། དྲན་པ་དང་ལྡན་པས། འཇིག་རྟེན་གྱི་ཆགས་སེམས་དང་། ཡིད་མི་བདེ་བ་རྣམ་པར་བསལ་ཞིང་རྣམ་པར་སྤྱོད་དོ།
en: As they conduct themselves, diligent, alert, and mindful, they are rid of the world’s attractions and dissatisfactions. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ལུས་འདི་ལ་སའི་ཁམས་དང་། ཆུའི་ཁམས་དང་། མེའི་ཁམས་དང་། རླུང་གི་ཁམས་ཀྱང་ཡོད་དོ། །ཞེས་བྱ་བར་ཁམས་ཀྱི་རྣམ་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་དུ་རྟོག་སྟེ། རབ་འབྱོར་འདི་ལྟ་སྟེ། དཔེར་ན། བ་ལང་གི་ཤེན་པའམ། བ་ལང་གི་ཤེན་པའི་མཆན་བུ་མཁས་པས། མཚོན་རྣོན་པོ་ཐོགས་ཏེ། བ་ལང་བསད་ཅིང་བག་བཞིར་གཤེགས་ཏེ། སོ་སོར་ཕྱེ་ནས་འགྲེང་ངམ་འདུག་སྟེ། དེ་ལ་རབ་ཏུ་རྟོག་པ་དེ་བཞིན་དུ།
en: Moreover, Subhūti, when bodhisattva great beings practice the perfection of wisdom, they discern this physical body in terms of its material elements, observing that it comprises the element of earth, the element of water, the element of fire, and the element of wind.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ཡང་། ལུས་འདི་ལ་སའི་ཁམས་དང་། ཆུའི་ཁམས་དང་། མེའི་ཁམས་དང་། རླུང་གི་ཁམས་ཀྱང་ཡོད་དོ་ཞེས་བྱ་བར་ཁམས་ཀྱི་རྣམ་པ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རྟོག་སྟེ།
en: Subhūti, as an analogy, just as a skilled butcher of bulls or a skilled apprentice of a butcher of bulls slays a bull with a sharp instrument, cuts it into four parts, and then examines the quartered carcass, as he stands or sits, in the same way bodhisattva great beings who practice the perfection of wisdom also discern this same physical body in terms of its material elements, observing that it comprises the element of earth, the element of water, the element of fire, and the element of wind.

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། འགྲེང་ངམ་འདུག་སྟེ། ནང་གི་ལུས་ལ་དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་ལུས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་།
en: Subhūti, it is in this way that bodhisattva great beings practice the perfection of wisdom and, while they stand or sit, with regard to the inner body, observe the physical body without apprehending anything.

source: བརྩོན་འགྲུས་ཅན་ཤེས་བཞིན་དང་ལྡན་པ། དྲན་པ་དང་ལྡན་པས། འཇིག་རྟེན་གྱི་ཆགས་སེམས་དང་། ཡིད་མི་བདེ་བ་རྣམ་པར་བསལ་ཅིང་རྣམ་པར་སྤྱོད་དོ།
en: As they conduct themselves, diligent, alert, and mindful, they are rid of the world’s attractions and dissatisfactions. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ལུས་འདི་ཉིད་ལ་རྐང་པའི་མཐིལ་ཡན་ཅད། སྐྲ་དང་། ཀླད་པ་མན་ཅད། སེན་མོ་དང་། སྤུ་དང་། པགས་པ་ཡན་ཅད། མི་གཙང་བ་སྣ་ཚོགས་ཀྱིས་གང་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རྟོག་སྟེ། ལུས་འདི་ལ་སྐྲ་དང་། སྤུ་དང་། སེན་མོ་དང་། པགས་པ་དང་། གློག་པ་དང་། ཤ་དང་། ཆུ་བ་དང་།
en: Moreover, Subhūti, when bodhisattva great beings practice the perfection of wisdom, they discern that this same body is full of manifold impurities, from the soles of the feet upward, from the hairs [of the head] and the brain downward, and from the hairs of the body, the nails, and the skin inward.

source: ཁྲག་དང་། རུས་པ་དང་། རྐང་དང་། སྙིང་དང་། མཁལ་མ་དང་། མཆིན་པ་དང་། གློ་བ་དང་། མཚེར་པ་དང་། ལོང་ཀ་དང་། རྒྱུ་མ་དང་། གཉེ་མ་དང་། ནང་གྲོལ་དང་། གཅིན་དང་། ཕྱི་ས་དང་། མཆི་མ་དང་། རྔུལ་དང་། ཚིལ་དང་། སྣབས་དང་། ངར་སྣབས་དང་། རྣག་དང་། མཁྲིས་པ་དང་། བད་ཀན་དང་། ཆུ་སེར་དང་། ཁ་ཆུ་དང་། དྲི་མ་དང་། ཀླད་པ་དང་། ཀླད་རྒྱས་དང་། རྔུ་མ་དང་། རྣ་སྤབས་དག་ཀྱང་ཡོད་དོ་ཞེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་དུ་རྟོག་སྟེ། རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན། ཆུན་པའི་སྒྱེ་སྣོད་ཏིལ་དང་། ཡུངས་ཀར་དང་། སྲན་ཆུང་དང་། བལ་སྲན་དང་། ནས་དང་། གྲོ་དང་། འབྲས་དང་།
en: That is to say, they discern that it comprises the hairs of the head, the hairs of the body, the nails, epidermal skin, inner skin, flesh, ligaments, blood, bones, marrow, heart, kidneys, liver, lungs, spleen, large intestine, small intestine, sigmoid colon, viscera, urinary bladder, excrement, tears, sweat, adipose tissue, mucous, nasal mucous, pus, bile, phlegm, serum, saliva, odors, brain tissue, cerebral secretions, eye mucus, and ear wax.

source: འབྲུ་སྣ་ཚོགས་ཀྱིས་གང་བ། མིག་དང་ལྡན་པའི་མི་ཞིག་གིས་ཕྱེ་སྟེ་བལྟས་ན། འདི་ནི་ཏིལ་ལོ། །འདི་ནི་ཡུངས་ཀར་རོ། །འདི་ནི་སྲན་ཆུང་ངོ་། །འདི་ནི་བལ་སྲན་ནོ། །འདི་ནི་ནས་སོ། །འདི་ནི་གྲོའོ། །འདི་ནི་འབྲས་སོ། །འདི་དག་ནི་དེ་མ་ཡིན་པའི་འབྲུ་གཞན་ནོ་ཞེས་བྱ་བར་རབ་ཏུ་ཤེས་སོ།
en: Subhūti, this is just like when the grain bins of a farmer have been filled with diverse crops—sesame, mustard seeds, lentils, beans, barley, wheat, and rice—and an observant passer-by, {Dt.206} on seeing them, would know that these are sesame, these are mustard seeds, these are lentils, these are beans, these are barley, these are wheat, and these are rice. “

source: །རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡང་ལུས་འདི་ཉིད་ལ་རྐང་པའི་མཐིལ་ཡན་ཅད། སྐྲ་དང་། སྤྱི་བོ་མན་ཅད། སེན་མོ་དང་། སྤུ་དང་། པགས་པ་ཡན་ཆད། མི་གཙང་བ་སྣ་ཚོགས་ཀྱིས་གང་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་རྟོག་སྟེ། ལུས་འདི་ལ་སྐྲ་དང་། སྤུ་དང་། སེན་མོ་དང་པགས་པ་དང་། གློག་པ་དང་། ཤ་དང་། ཆུ་བ་དང་།
en: Subhūti, in the same way, bodhisattva great beings discern that this very body is full of manifold impurities, from the soles of the feet upward, from the hair and the crown of the head downward, and from the nails, body hair, and skin inward.

source: ཁྲག་དང་། རུས་པ་དང་། རྐང་དང་། སྙིང་དང་། མཁལ་མ་དང་། མཆིན་པ་དང་། གློ་བ་དང་། མཚེར་པ་དང་། ལོང་ཀ་དང་། རྒྱུ་མ་དང་། གཉེ་མ་དང་། ནང་གྲོལ་དང་། གཅིན་དང་། ཕྱི་ས་དང་། མཆི་མ་དང་། རྔུལ་དང་། ཚིལ་དང་། སྣབས་དང་། ངར་སྣབས་དང་། རྣག་དང་། མཁྲིས་པ་དང་། བད་ཀན་དང་། ཆུ་སེར་དང་། ཁ་ཆུ་དང་། དྲི་མ་དང་། ཀླད་པ་དང་།
en: That is to say, they discern that this body comprises the hairs of the head, the hairs of the body, the nails, epidermal skin, inner skin, flesh, ligaments, blood, bones, marrow, heart, kidneys, liver, lungs, spleen, large intestine, small intestine, sigmoid colon, viscera, urinary bladder, excrement, tears, sweat, adipose tissue, mucous, nasal mucus, pus, bile, phlegm, serum, saliva, odors, brain tissue, cerebral secretions, eye mucus, and ear wax.

source: ཀླད་རྒྱས་དང་། རྔུ་མ་དང་། རྣ་སྤབས་དག་ཀྱང་ཡོད་དོ་ཞེས་བྱ་བར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་རྟོག་གོ །རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ནང་གི་ལུས་ལ་དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་ལུས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་།
en: Subhūti, it is in this way that when bodhisattva great beings practice the perfection of wisdom, with regard to the inner body, they observe the physical body without apprehending anything.

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱད་པའི་ཚེ། ནམ་དུར་ཁྲོད་ན་ཡོད་པའི་གཟུགས་སྣ་ཚོགས་དུར་ཁྲོད་དུ་བོར་བ། རོའི་མལ་དུ་བསྙལ་བ། ཤི་ནས་ཞག་གཅིག་ལོན་པ་འམ། ཤི་ནས་ཞག་གཉིས་ལོན་པ་འམ། ཤི་ནས་ཞག་གསུམ་ལོན་པ་འམ། ཤི་ནས་ཞག་བཞི་ལོན་པ་འམ། ཤི་ནས་ཞག་ལྔ་ལོན་པ་འམ། རྣམ་པར་བམ་པ་འམ། རྣམ་པར་སྔོས་པ་འམ། རྣམ་པར་རྣགས་པ་འམ། རྣམ་པར་གཞིགས་པ་འམ། རྣམ་པར་ཟོས་པ་འམ། རྣམ་པར་འཐོར་བ་མཐོང་ན།
en: Moreover, Subhūti, when bodhisattva great beings practice the perfection of wisdom, on seeing in a charnel ground the manifold forms of the corpses that have been discarded there—those that have been laid to rest; those that have been dead for one day, dead for two days, dead for three days, dead for four days, or dead for five days; and those that are bloated, blue-black, putrefied, worm-infested, devoured, or dismembered—they compare these circumstances to their own bodies, reflecting, ‘This body too has attributes such as these.

source: དེ་ལུས་འདི་ཉིད་ཀྱི་ཚུལ་ཡང་དེ་དང་སྦྱོར་ཏེ། ལུས་འདི་ཡང་འདི་ལྟ་བུའི་ཆོས་ཅན། འདི་ལྟ་བུའི་རང་བཞིན་ཅན་ཏེ།
en: It has a nature such as these.

source: ཆོས་ཉིད་འདི་ལས་མ་འདས་པའོ་ཞེས་བྱ་བར་ཉེ་བར་སྦྱོར་རོ།
en: It does not go beyond this reality!’

source: །རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཕྱིའི་ལུས་ལ་དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་ལུས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་།
en: Subhūti, it is in this way that when bodhisattva great beings practice the perfection of wisdom, with regard to the outer body, they observe the physical body without apprehending anything.

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ནམ་དུར་ཁྲོད་དུ་བོར་བའི་རོ་ཤི་ནས་ཞག་དྲུག་ལོན་པའམ། ཤི་ནས་ཞག་བདུན་ལོན་པ་བྱ་རོག་གམ། ཁྭའམ། འོལ་བའམ། བྱ་རྒོད་ངམ། སྤྱང་ཀི་འམ། ཝ་འམ། ཁྱི་འམ། དེ་མ་ཡིན་པའི་སྲོག་ཆགས་ཀྱི་རིགས་སྣ་ཚོགས་ཀྱིས་བཟའ་བ་མཐོང་བ་དེའི་ཚེ་དེ་ལུས་འདི་ཉིད་ཀྱི་ཚུལ་ཡང་དེ་དང་སྦྱོར་ཏེ།
en: Moreover, Subhūti, when bodhisattva great beings practice the perfection of wisdom, on seeing corpses that have been discarded in a charnel ground, dead for six days, dead for seven days, devoured by various sorts of wild creatures—ravens, crows, hawks, vultures, wolves, foxes, dogs, and others—at that time, they compare these to the circumstances of their own bodies, reflecting, ‘This body too has attributes such as these.

source: ལུས་འདི་ཉིད་ཀྱང་འདི་ལྟ་བུའི་ཆོས་ཅན། འདི་ལྟ་བུའི་རང་བཞིན་ཅན་ཏེ།
en: It has a nature such as these.

source: ཆོས་ཉིད་འདི་ལྟ་བུ་ལས་མ་འདས་སོ། །ཞེས་བྱ་བར་ཉེ་བར་རྟོག་གོ །
en: It does not go beyond this reality!’

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཕྱིའི་ལུས་ལ་དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་ལུས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་།
en: Subhūti, it is in this way that when bodhisattva great beings practice the perfection of wisdom, with regard to the outer body, they observe the physical body without apprehending anything.

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ནམ་དུར་ཁྲོད་དུ་བོར་བའི་རོ་རྣམ་པར་ཟོས་པ། མི་གཙང་བ། རྣགས་པ། རྣམ་པར་སྲུངས་པ་མཐོང་བ་དེའི་ཚེ།
en: Moreover, Subhūti, when bodhisattva great beings practice the perfection of wisdom, on seeing corpses that have been discarded in a charnel ground, devoured, foul, festering, and rotten, they compare these to the circumstances of their own bodies, reflecting, ‘This body too has attributes such as these.

source: ལུས་འདི་ཉིད་ཀྱི་ཚུལ་ཡང་དེ་དང་སྦྱོར་ཏེ། ལུས་འདི་ཡང་འདི་ལྟ་བུའི་ཆོས་ཅན། འདི་ལྟ་བུའི་རང་བཞིན་ཅན་ཏེ།
en: It has a nature such as these.

source: འདི་ལྟ་བུའི་ཆོས་ཉིད་ལས་མ་འདས་པའོ།
en: It does not go beyond this reality!’

source: །ཞེས་བྱ་བར་ཉེ་བར་རྟོག་གོ །རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཕྱིའི་ལུས་ལ་དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་ལུས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་།
en: Subhūti, it is in this way that when bodhisattva great beings practice the perfection of wisdom, with regard to the outer body, they observe the physical body without apprehending anything.

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ནམ་དུར་ཁྲོད་ཀྱི་རུས་པ། ཀེང་རུས་ཤ་ར་རི་དང་། ཁྲག་ར་རི་ཆགས་པ། རྒྱུས་པས་བྲང་བྲེང་དུ་འབྲེལ་པ་མཐོང་བ་དེའི་ཚེ།
en: Moreover, Subhūti, when bodhisattva great beings practice the perfection of wisdom, on seeing the bones in a charnel ground, skeletons with fragments of flesh, smears of blood, tenuously joined together by tendons, they compare these to the circumstances of their own bodies, reflecting, ‘This body too has attributes such as these.

source: འདི་ལྟ་བུའི་ཆོས་ཉིད་ལས་མ་འདས་པའོ་ཞེས་བྱ་བར་ཉེ་བར་རྟོག་གོ །
en: It does not go beyond this reality!’

source: བརྩོན་འགྲུས་ཅན་ཤེས་བཞིན་དང་ལྡན་པ། དྲན་པ་དང་ལྡན་པས། འཇིག་རྟེན་གྱི་ཆགས་སེམས་དང་། ཡིད་མི་བདེ་བ་རྣམ་པར་བསལ་ཅིང་རྣམ་པར་སྤྱད་དོ།
en: As they conduct themselves, diligent, alert, and mindful, they are rid of the world’s attractions and dissatisfactions. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ནམ་དུར་ཁྲོད་ཀྱི་རུས་པ་ཀེང་རུས་ཤ་དང་། ཁྲག་མེད་པ། རྒྱུས་པའི་གཟུངས་མེད་པ། དུང་གི་མདོག་ལྟར་གྱུར་པ་མཐོང་བ་དེའི་ཚེ།
en: Moreover, Subhūti, when bodhisattva great beings practice the perfection of wisdom, on seeing the skeletal bones in a charnel ground, devoid of flesh and blood, without the adhesion of tendons, {Dt.207} as white as conch shells, they compare these to the circumstances of their own bodies, reflecting, ‘This body too has attributes such as these.

source: དེ་ལུས་འདི་ཉིད་ཀྱི་ཚུལ་ཡང་དེ་དང་ཉེ་བར་སྦྱོར་ཏེ། ལུས་འདི་ཉིད་ཀྱང་འདི་ལྟ་བུའི་ཆོས་ཅན་འདི་ལྟ་བུའི་རང་བཞིན་ཅན་ཏེ།
en: It has a nature such as these.

source: །ཞེས་བྱ་བར་ཉེ་བར་རྟོག་གོ །རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཕྱིའི་ལུས་ལ་དེ་མི་དམིགས་པའི་ཚུལ་གྱིས་ལུས་ཀྱི་རྗེས་སུ་ལྟ་ཞིང་། བརྩོན་འགྲུས་ཅན་ཤེས་བཞིན་དང་ལྡན་པ།
en: Subhūti, it is in this way that when bodhisattva great beings practice the perfection of wisdom, with regard to the outer body, they observe the physical body without apprehending anything.

source: དྲན་པ་དང་ལྡན་པས། འཇིག་རྟེན་གྱི་ཆགས་སེམས་དང་། ཡིད་མི་བདེ་བ་རྣམ་པར་བསལ་ཅིང་རྣམ་པར་སྤྱོད་དོ།། །།ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ། བམ་པོ་བཅུ་བདུན་པ། རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ནམ་དུར་ཁྲོད་ཀྱི་རུས་པ།
en: As they conduct themselves, diligent, alert, and mindful, they are rid of the world’s attractions and dissatisfactions. “
